Revit 2027 API
MEPSystem.BaseEquipment Property
The base panel or equipment of the system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyInstance BaseEquipment { get; }
Public ReadOnly Property BaseEquipment As FamilyInstance
	Get
public:
property FamilyInstance^ BaseEquipment {
	FamilyInstance^ get ();
}
member BaseEquipment : FamilyInstance with get
Property Value
FamilyInstance
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace